In [1]:
#Programmer :Gaikwad Trupti S.
#College:Keystone school engineering pune
#Class:TE
#Roll no.:19

In [2]:
# pandas -> structured data analysis
import pandas as pd
#numpy -> Array operations
import numpy as np

# Array

In [10]:
num = np.array([34,12,37,65,48,79,15],dtype=np.int16)
num

array([34, 12, 37, 65, 48, 79, 15], dtype=int16)

In [11]:
type(num)

numpy.ndarray

In [12]:
num.dtype#windows=32 and linux=64     #dtype=np.int16=then output is 16

dtype('int16')

In [13]:
num[2]

37

# Series

Series is class under pandas lib.

In [15]:
s=pd.Series([45,12,38,75,19,36])

In [16]:
s

0    45
1    12
2    38
3    75
4    19
5    36
dtype: int64

In [17]:
type(s)

pandas.core.series.Series

In [18]:
s.dtype

dtype('int64')

In [19]:
s.size

6

In [20]:
s.shape

(6,)

In [22]:
s=pd.Series([45,12,38,75,19,36],index=range(100,106))# we can change index values
s

100    45
101    12
102    38
103    75
104    19
105    36
dtype: int64

In [23]:
s[105]

36

# Data Frame

In [24]:
r=pd.Series([1,2,3,4,5])
n=pd.Series(['prem','raj','kiran','priya','asha'])
m=pd.Series([67.89,73.57,71.56,67,66.66])
#data frame is collection of similar data elements

In [25]:
df=pd.DataFrame({
    'roll':r,
    'name':n,
    'marks':m
}
)

In [26]:
df

   roll   name  marks
0     1   prem  67.89
1     2    raj  73.57
2     3  kiran  71.56
3     4  priya  67.00
4     5   asha  66.66

In [27]:
df.shape

(5, 3)

In [28]:
df.size

15

In [30]:
df.dtypes

roll       int64
name      object
marks    float64
dtype: object

In [31]:
type(df)

pandas.core.frame.DataFrame

# Structured Data Analysis

download all the datasets whose name starts with student.....
from below link and store in current working directory

import the data

In [2]:
import pandas as pd

In [3]:
df=pd.read_csv('student.csv')

In [4]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [5]:
df1=pd.read_csv('student1.csv')

In [6]:
df1

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [7]:
cols = ['A','B','C','D','E']
df1=pd.read_csv('student1.csv' ,names=cols)

In [8]:
df1

    A        B   C      D   E
0   1     anil  TE  56.77  22
1   2     amit  TE  59.77  21
2   3   aniket  BE  76.88  19
3   4  ajinkya  TE  69.66  20
4   5     asha  TE  63.28  20
5   6   ayesha  BE  49.55  20
6   7     amar  BE  65.34  19
7   8    amita  BE  68.33  23
8   9     amol  TE  56.75  20
9  10    anmol  BE  78.66  21

In [11]:
df3=pd.read_csv('student3.tsv')#tsc tab saperated

In [12]:
df3

  roll\tname\tclass\tmarks\tage
0        1\tanil\tTE\t56.77\t22
1        2\tamit\tTE\t59.77\t21
2      3\taniket\tBE\t76.88\t19
3     4\tajinkya\tTE\t69.66\t20
4        5\tasha\tTE\t63.28\t20
5      6\tayesha\tBE\t49.55\t20
6        7\tamar\tBE\t65.34\t19
7       8\tamita\tBE\t68.33\t23
8        9\tamol\tTE\t56.75\t20
9      10\tanmol\tBE\t78.66\t21

In [14]:
#read data from link
df2=pd.read_csv('https://gist.githubusercontent.com/justimchung/9b98c69b30600a46daa6d2e827c31b56/raw/4b1f08ba9b00a2fcd3f7ced9cf9e59062f489c3a/student.csv')

In [15]:
df2

  Unnamed: 0    Name  height  weight  sex       bdate       city major
0   s1234567   Peter   175.0   70.45    1   1980/4/30     Tainan  CSIE
1   e1234567    Mary   163.0   55.00    2  1981/12/21     Taipei    EE
2   f1357689    John   180.4   80.30    1   1980/5/30     Tainan  Stat
3   e1374659   Keven   182.5   77.60    1  1980/11/19     Taipei    EE
4   s7758347    JoJo   170.3   50.30    2   1980/1/27     Taipei  CSIE
5   s1334987   Emily   168.5   53.60    2  1982/10/13  Kaohsiung  CSIE
6   e1384726  Ubuntu   177.0   68.30    1    1981/7/6  Kaohsiung    EE

In [17]:
dfx=pd.read_excel('student.xlsx')

In [18]:
dfx

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

# Using the dataframe object attributes

In [19]:
df.shape

(10, 5)

In [20]:
df.size

50

In [21]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [23]:
df.dtypes

roll       int64
name      object
class     object
marks    float64
age        int64
dtype: object

In [24]:
df.ndim #number of dimension

2

In [25]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [26]:
df.T  #T for transpose row->col   and col->row

,0,1,2,3,4,5,6,7,8,9
roll,1,2,3,4,5,6,7,8,9,10
name,anil,amit,aniket,ajinkya,asha,ayesha,amar,amita,amol,anmol
class,TE,TE,BE,TE,TE,BE,BE,BE,TE,BE
marks,56.77,59.77,76.88,69.66,63.28,49.55,65.34,68.33,56.75,78.66
age,22,21,19,20,20,20,19,23,20,21

# Functions or methods

In [27]:
df.head()

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20

In [28]:
df.head(3)

   roll    name class  marks  age
0     1    anil    TE  56.77   22
1     2    amit    TE  59.77   21
2     3  aniket    BE  76.88   19

In [29]:
df.tail()

   roll    name class  marks  age
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
8     9    amol    TE  56.75   20
9    10   anmol    BE  78.66   21

In [30]:
df.tail(3)

   roll   name class  marks  age
7     8  amita    BE  68.33   23
8     9   amol    TE  56.75   20
9    10  anmol    BE  78.66   21